src/main/resources/xml/accommodationSalesServicePort/retrievePostedCancellationFee/retrievePostedCancellationFee.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sal:retrievePostedCancellationFee>
         <request>
            <cancelDate>?</cancelDate>
            <!--1 or more repetitions:-->
            <identityDetails>
               <!--Optional:-->
               <id>?</id>
               <!--Optional:-->
               <externalReferenceDetail>
                  <!--Optional:-->
                  <externalReferenceType>?</externalReferenceType>
                  <!--Optional:-->
                  <externalReferenceCode>?</externalReferenceCode>
                  <!--Optional:-->
                  <externalReferenceNumber>?</externalReferenceNumber>
                  <!--Optional:-->
                  <externalReferenceSource>?</externalReferenceSource>
               </externalReferenceDetail>
               <!--Optional:-->
               <identityLevel>?</identityLevel>
            </identityDetails>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </sal:retrievePostedCancellationFee>
   </soapenv:Body>
</soapenv:Envelope>
